app/controllers/posts_controller.rb

  def create
    @post = Post.new(params[:post])

    if @post.save
---
INSERT INTO "posts" ("content", "created_at", "title", "updated_at") VALUES (?, ?, ?, ?)  [["content", nil], ["created_at", Sat, 08 Jun 2013 07:43:59 UTC +00:00], ["title", nil], ["updated_at", Sat, 08 Jun 2013 07:43:59 UTC +00:00]]

  def update
    @post = Post.find(params[:id])
    if @post.update_attributes(params[:post])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "4"]]
UPDATE "posts" SET "title" = 'This is fourth Post', "content" = 'Now Let''s see if it is updated :)', "updated_at" = '2013-06-08 09:57:40.227796' WHERE "posts"."id" = 4